w6d3/app/controllers/users_controller.rb

  def create
    # sign up the user
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    if current_user.nil?
      # let them log in
      redirect_to new_session_url
      return
    end

    @user = User.includes(tweets: :mentioned_users).find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]

  def search
    # debugger
    if params[:query].present?
      @users = User.where("username ~ ?", params[:query])
---
SELECT "users".* FROM "users"  WHERE (username ~ 'giz')